---
kind: enumMember
id: F:Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.OffsetRequired
enum: Autodesk.Revit.DB.Fabrication.FabricationPartFitResult
source: html/36a9c1b4-343e-c0ce-fd27-8b42b8a82288.htm
---
# Autodesk.Revit.DB.Fabrication.FabricationPartFitResult.OffsetRequired

Failed due to additional offset dimensions or fittings being required that weren't available.